<?php

namespace Database\Seeders;

use App\Models\Area;
use App\Models\City;
use Illuminate\Database\Seeder;

class AreasSeeder extends Seeder
{
    public function run(): void
    {
        $areasData = [
            'دمشق' => ['المزة', 'المالكي', 'أبو رمانة', 'ركن الدين ', 'القصاع', 'المهاجرين', 'الشعلان', 'الميدان', 'باب توما', 'القصور', 'كفرسوسة'],
            'ريف دمشق' => ['دوما', 'جرمانا', 'داريا', 'الزبداني', 'يبرود', 'قطنا', 'صحنايا', 'عربين', 'حرستا', 'التل'],
            'حلب' => ['العزيزية', 'الفرقان', 'الحمدانية', 'الشهباء', 'الفيحاء', 'السليمانية', 'الموكامبو', 'الأشرفية', 'صلاح الدين', 'الميدان'],
            'حمص' => ['الوعر', 'الزهراء', 'الإنشاءات', 'الخالدية', 'باب السباع', 'الحميدية', 'الغوطة', 'الورشة', 'القصور', 'الوليد'],
            'حماة' => ['الحاضر', 'الحميدية', 'الشريعة', 'الجراجمة', 'الصابونية', 'المدينة', 'كازو', 'الأربعين', 'الطوافرة', 'الشمالية'],
            'اللاذقية' => ['الزراعة', 'الرمل الشمالي', 'الرمل الجنوبي', 'الصليبة', 'المشروع الأول', 'المشروع الثاني', 'الشاطئ الأزرق', 'الأوتوستراد', 'الطابيات', 'القلعة'],
            'طرطوس' => ['الثورة', 'الشهداء', 'الحمام', 'الباسل', 'المنشية', 'الشرقية', 'الغربية', 'الزهراء', 'الكورنيش', 'المرفأ'],
            'إدلب' => ['المدينة', 'الشمالية', 'الجنوبية', 'الشرقية', 'الغربية', 'الحي الجديد', 'الصناعة', 'الزراعة', 'المحطة', 'الجامع الكبير'],
            'درعا' => ['البلد', 'المحطة', 'الصنمين', 'إزرع', 'نوى', 'الشيخ مسكين', 'طفس', 'الحراك', 'بصرى الشام', 'الجيزة'],
            'السويداء' => ['المدينة', 'الشمالية', 'الجنوبية', 'الشرقية', 'الغربية', 'صلخد', 'شهبا', 'القريا', 'المزرعة', 'عتيل'],
            'القنيطرة' => ['المدينة', 'الشمالية', 'الجنوبية', 'الشرقية', 'الغربية', 'خان أرنبة', 'جباثا الخشب', 'مسعدة', 'فيق', 'حضر'],
            'دير الزور' => ['الجورة', 'الحميدية', 'الرشدية', 'الشيخ ياسين', 'الصناعة', 'الميادين', 'البوكمال', 'العشارة', 'الموحسن', 'الحسينية'],
            'الرقة' => ['المدينة', 'الثورة', 'الرشيد', 'الصناعة', 'الرملة', 'المنصور', 'تل أبيض', 'الطبقة', 'الثورة', 'السبخة'],
            'الحسكة' => ['المدينة', 'الناصرة', 'غويران', 'الصالحية', 'العزيزية', 'القامشلي', 'رأس العين', 'المالكية', 'عامودا', 'تل تمر']
        ];

        foreach ($areasData as $cityName => $areas) {
            $city = City::where('name', $cityName)->first();
            if ($city) {
                foreach ($areas as $areaName) {
                    Area::create([
                        'city_id' => $city->id,
                        'name' => $areaName
                    ]);
                }
            }
        }
    }
}
